In [48]:
import pandas as pd
import numpy as np

In [49]:
df = pd.read_csv(
    "../data/df2_0129.csv"
)

df

,url,title,company,location,scrape_date,scrape_time
0,https://in.indeed.com/viewjob?jk=8a6bb0507eba5bbf,Data Engineer/ETL Developer,Princeton IT America,"KA, IN",2025-07-16,12:23:55
1,https://www.linkedin.com/jobs/view/4265959832,2702- Data Engineer,EXL,"Pune, Maharashtra, India",2025-07-16,12:23:55
2,https://www.linkedin.com/jobs/view/4267652354,Data Engineer,SatSure,"Bangalore Urban, Karnataka, India",2025-07-16,12:23:55
3,https://www.linkedin.com/jobs/view/4267647369,DevOps/Cloud Engineer,BayOne Solutions,"Bengaluru, Karnataka, India",2025-07-16,12:23:55
4,https://www.linkedin.com/jobs/view/4265960423,AI Developer – Immediate Joiners Only,Perimattic,"Mumbai, Maharashtra, India",2025-07-16,12:23:55
...,...,...,...,...,...,...
2227,https://www.linkedin.com/jobs/view/4309720429,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2228,https://www.linkedin.com/jobs/view/4309719532,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2229,https://www.linkedin.com/jobs/view/4309701623,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2230,https://www.linkedin.com/jobs/view/4309703481,Senior AI Developer - Bangalore,SAP,"Bengaluru, Karnataka, India",2025-10-06,10:23:15
2231,https://www.linkedin.com/jobs/view/4309718555,Senior Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15

# 1. 데이터 정보

In [50]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 2232 entries, 0 to 2231
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   url          2232 non-null   str
 1   title        2232 non-null   str
 2   company      2231 non-null   str
 3   location     1798 non-null   str
 4   scrape_date  2232 non-null   str
 5   scrape_time  2232 non-null   str
dtypes: str(6)
memory usage: 104.8 KB

In [51]:
df.shape

(2232, 6)

In [52]:
df.describe()

,url,title,company,location,scrape_date,scrape_time
count,2232,2232,2231,1798,2232,2232
unique,2129,758,967,106,26,600
top,https://www.linkedin.com/jobs/view/4307968830,Remote Python AI Engineer - 17852,Turing,"Bengaluru, Karnataka, India",2025-07-16,13:55:55
freq,10,149,284,434,298,31

# 2. 데이터 전처리

## 1) 데이터 형 변환

In [53]:
df["scrape_date"] = pd.to_datetime(df["scrape_date"], errors="coerce")
df["scrape_time"] = pd.to_datetime(df["scrape_time"], format="%H:%M:%S", errors="coerce").dt.time

In [54]:
df["scrape_date"].head()

0   2025-07-16
1   2025-07-16
2   2025-07-16
3   2025-07-16
4   2025-07-16
Name: scrape_date, dtype: datetime64[us]

In [55]:
df["scrape_time"].head()

0    12:23:55
1    12:23:55
2    12:23:55
3    12:23:55
4    12:23:55
Name: scrape_time, dtype: object

In [56]:
df

,url,title,company,location,scrape_date,scrape_time
0,https://in.indeed.com/viewjob?jk=8a6bb0507eba5bbf,Data Engineer/ETL Developer,Princeton IT America,"KA, IN",2025-07-16,12:23:55
1,https://www.linkedin.com/jobs/view/4265959832,2702- Data Engineer,EXL,"Pune, Maharashtra, India",2025-07-16,12:23:55
2,https://www.linkedin.com/jobs/view/4267652354,Data Engineer,SatSure,"Bangalore Urban, Karnataka, India",2025-07-16,12:23:55
3,https://www.linkedin.com/jobs/view/4267647369,DevOps/Cloud Engineer,BayOne Solutions,"Bengaluru, Karnataka, India",2025-07-16,12:23:55
4,https://www.linkedin.com/jobs/view/4265960423,AI Developer – Immediate Joiners Only,Perimattic,"Mumbai, Maharashtra, India",2025-07-16,12:23:55
...,...,...,...,...,...,...
2227,https://www.linkedin.com/jobs/view/4309720429,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2228,https://www.linkedin.com/jobs/view/4309719532,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2229,https://www.linkedin.com/jobs/view/4309701623,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15
2230,https://www.linkedin.com/jobs/view/4309703481,Senior AI Developer - Bangalore,SAP,"Bengaluru, Karnataka, India",2025-10-06,10:23:15
2231,https://www.linkedin.com/jobs/view/4309718555,Senior Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15

## 2) 결측치

In [57]:
df.isna().sum()

url              0
title            0
company          1
location       434
scrape_date      0
scrape_time      0
dtype: int64

### company

In [58]:
df['company'] = df['company'].fillna('Unknown')

### location

In [59]:
df["location"].value_counts()

location
Bengaluru, Karnataka, India          434
Pune, Maharashtra, India             190
Hyderabad, Telangana, India          173
Chennai, Tamil Nadu, India            89
Gurugram, Haryana, India              80
                                    ...
Chandigarh, Chandigarh, India          1
Ernakulam, Kerala, India               1
Delhi, Delhi, India                    1
Serilingampalli, Telangana, India      1
Arunachal Pradesh, India               1
Name: count, Length: 106, dtype: int64

In [60]:
df['location'] = df['location'].fillna('Unknown')

In [61]:
df.isna().sum()

url            0
title          0
company        0
location       0
scrape_date    0
scrape_time    0
dtype: int64

 ## 3) 중복값 확인

In [62]:
# url이 같을 경우
# 같은 회사의 같은 직무, 같은 시간대에 올라온 공고의 효용 확인

In [63]:
df['duplicate_url'] = df['url'].duplicated(keep='first')

In [64]:
df['duplicate_url'].value_counts()

duplicate_url
False    2129
True      103
Name: count, dtype: int64

In [65]:
df.loc[df['url'].duplicated(keep=False),['company', 'title', 'location', 'scrape_date', 'scrape_time', 'url']].sort_values('url')

,company,title,location,scrape_date,scrape_time,url
2019,BrainCord,AI DEVELOPER INTERN,"KL, IN",2025-10-03,18:01:16,https://in.indeed.com/viewjob?jk=00c9df284a3543b7
2031,BrainCord,AI DEVELOPER INTERN,"KL, IN",2025-10-03,18:12:20,https://in.indeed.com/viewjob?jk=00c9df284a3543b7
744,Domnic Lewis,Senior Machine Learning Engineer (R0099955),"KA, IN",2025-09-19,10:25:17,https://in.indeed.com/viewjob?jk=2cc2d5dad7370915
697,Domnic Lewis,Senior Machine Learning Engineer (R0099955),"KA, IN",2025-09-19,05:18:55,https://in.indeed.com/viewjob?jk=2cc2d5dad7370915
1922,Flexport,Senior Machine Learning Engineer,"KA, IN",2025-10-02,14:43:44,https://in.indeed.com/viewjob?jk=390907f3331c6343
...,...,...,...,...,...,...
2045,Bayer,AI Engineer,"Bengaluru, Karnataka, India",2025-10-03,18:21:21,https://www.linkedin.com/jobs/view/4310159212
1975,Bayer,AI Engineer,"Bengaluru, Karnataka, India",2025-10-03,12:40:47,https://www.linkedin.com/jobs/view/4310159212
2047,Bayer,AI Engineer,"Bengaluru, Karnataka, India",2025-10-03,18:21:21,https://www.linkedin.com/jobs/view/4310173013
2024,Bayer,AI Engineer,"Bengaluru, Karnataka, India",2025-10-03,18:01:16,https://www.linkedin.com/jobs/view/4310173013
1977,Bayer,AI Engineer,"Bengaluru, Karnataka, India",2025-10-03,12:40:47,https://www.linkedin.com/jobs/view/4310173013

In [66]:
# 회사, 직무명, 날짜시간, 장소가 중복되는 컬럼 생성
df["duplicate_meta"] = df.duplicated(subset=["company", "title", "scrape_time", "scrape_date", "location"],keep='first')

In [67]:
df

,url,title,company,location,scrape_date,scrape_time,duplicate_url,duplicate_meta
0,https://in.indeed.com/viewjob?jk=8a6bb0507eba5bbf,Data Engineer/ETL Developer,Princeton IT America,"KA, IN",2025-07-16,12:23:55,False,False
1,https://www.linkedin.com/jobs/view/4265959832,2702- Data Engineer,EXL,"Pune, Maharashtra, India",2025-07-16,12:23:55,False,False
2,https://www.linkedin.com/jobs/view/4267652354,Data Engineer,SatSure,"Bangalore Urban, Karnataka, India",2025-07-16,12:23:55,False,False
3,https://www.linkedin.com/jobs/view/4267647369,DevOps/Cloud Engineer,BayOne Solutions,"Bengaluru, Karnataka, India",2025-07-16,12:23:55,False,False
4,https://www.linkedin.com/jobs/view/4265960423,AI Developer – Immediate Joiners Only,Perimattic,"Mumbai, Maharashtra, India",2025-07-16,12:23:55,False,False
...,...,...,...,...,...,...,...,...
2227,https://www.linkedin.com/jobs/view/4309720429,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15,False,False
2228,https://www.linkedin.com/jobs/view/4309719532,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15,False,True
2229,https://www.linkedin.com/jobs/view/4309701623,Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15,False,True
2230,https://www.linkedin.com/jobs/view/4309703481,Senior AI Developer - Bangalore,SAP,"Bengaluru, Karnataka, India",2025-10-06,10:23:15,False,False
2231,https://www.linkedin.com/jobs/view/4309718555,Senior Data Scientist,People Prime Worldwide,"Hyderabad, Telangana, India",2025-10-06,10:23:15,False,False

In [68]:
# df["duplicate_meta"].value_counts()
df["duplicate_meta"].value_counts()

duplicate_meta
False    1987
True      245
Name: count, dtype: int64

In [69]:
# duplicate_meta의 True값
df_dup = df[df["duplicate_meta"]]

In [70]:
# 링크 대조를 위한 정렬
df_dup.sort_values(by="company")

,url,title,company,location,scrape_date,scrape_time,duplicate_url,duplicate_meta
893,https://www.linkedin.com/jobs/view/4303169745,AI Engineer,AV Academy and Edit Lab,"Lucknow, Uttar Pradesh, India",2025-09-20,12:38:10,False,True
299,https://in.indeed.com/viewjob?jk=bbe1fb7903ed6a57,DevOps Engineer,Accenture,"KA, IN",2025-07-17,01:55:22,False,True
225,https://www.linkedin.com/jobs/view/4264486810,Data Engineer,Accenture in India,"Bengaluru, Karnataka, India",2025-07-16,14:47:43,False,True
1075,https://www.linkedin.com/jobs/view/4302615768,Responsible AI Engineer,Accenture in India,"Bengaluru, Karnataka, India",2025-09-23,01:36:23,False,True
1762,https://www.linkedin.com/jobs/view/4307396652,Responsible AI Engineer,Accenture services Pvt Ltd,"Bengaluru, Karnataka, India",2025-10-01,09:22:46,False,True
...,...,...,...,...,...,...,...,...
624,https://www.linkedin.com/jobs/view/4269974746,Data Analyst Intern,WebBoost Solutions by UM,Unknown,2025-07-20,04:44:02,False,True
611,https://www.linkedin.com/jobs/view/4269929136,Data Analyst Intern,WebBoost Solutions by UM,Unknown,2025-07-19,17:20:02,False,True
625,https://www.linkedin.com/jobs/view/4269977468,Data Analyst Intern,WebBoost Solutions by UM,Unknown,2025-07-20,04:44:02,False,True
533,https://www.linkedin.com/jobs/view/4269117821,DevOps Engineer - L4,Wipro,"Hyderabad, Telangana, India",2025-07-18,06:34:11,False,True
1397,https://www.linkedin.com/jobs/view/4303483631,Machine Learning Engineer (T24),eBay,"Bengaluru, Karnataka, India",2025-09-25,16:26:01,False,True

In [71]:
pd.crosstab(df['duplicate_url'], df["duplicate_meta"])

duplicate_meta  False  True
duplicate_url
False            1886    243
True              101      2

In [72]:
def dup_type(row):
    if row['duplicate_url'] and row['duplicate_meta']:
        return 'strict_dup'
    elif row['duplicate_url']:
        return 'url_dup'
    elif row['duplicate_meta']:
        return 'meta_dup'
    else:
        return 'unique'

df['duplicate_type'] = df.apply(dup_type, axis=1)

In [73]:
df['duplicate_type'].value_counts()
# meta - url = meta_dup

duplicate_type
unique        1886
meta_dup       243
url_dup        101
strict_dup       2
Name: count, dtype: int64

In [74]:
df.loc[:, "duplicate_url":"duplicate_type"]

      duplicate_url  duplicate_meta duplicate_type
0             False           False         unique
1             False           False         unique
2             False           False         unique
3             False           False         unique
4             False           False         unique
...             ...             ...            ...
2227          False           False         unique
2228          False            True       meta_dup
2229          False            True       meta_dup
2230          False           False         unique
2231          False           False         unique

[2232 rows x 3 columns]

In [75]:
def remove_meta_and_strict_dup(df):
    remove_types = ['meta_dup', 'strict_dup']
    return df[~df['duplicate_type'].isin(remove_types)].copy()

In [76]:
df_clean = remove_meta_and_strict_dup(df)

In [77]:
df_clean["duplicate_meta"].value_counts()

duplicate_meta
False    1987
Name: count, dtype: int64

In [78]:
df_clean["duplicate_url"].value_counts()

duplicate_url
False    1886
True      101
Name: count, dtype: int64

In [79]:
df_clean.info()

<class 'pandas.DataFrame'>
Index: 1987 entries, 0 to 2231
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   url             1987 non-null   str
 1   title           1987 non-null   str
 2   company         1987 non-null   str
 3   location        1987 non-null   str
 4   scrape_date     1987 non-null   datetime64[us]
 5   scrape_time     1987 non-null   object
 6   duplicate_url   1987 non-null   bool
 7   duplicate_meta  1987 non-null   bool
 8   duplicate_type  1987 non-null   str
dtypes: bool(2), datetime64[us](1), object(1), str(5)
memory usage: 128.1+ KB

In [85]:
df_clean_2 = df_clean.drop(columns=["duplicate_meta","duplicate_type"])

In [86]:
df_clean_2.info()

<class 'pandas.DataFrame'>
Index: 1987 entries, 0 to 2231
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   url            1987 non-null   str
 1   title          1987 non-null   str
 2   company        1987 non-null   str
 3   location       1987 non-null   str
 4   scrape_date    1987 non-null   datetime64[us]
 5   scrape_time    1987 non-null   object
 6   duplicate_url  1987 non-null   bool
dtypes: bool(1), datetime64[us](1), object(1), str(4)
memory usage: 110.6+ KB

## 4) 불필요한 행 제거

In [91]:
# "indeed.com" 데이터 없애기
def remove_urls_containing(df_clean_2, keyword):
    return df_clean_2[~df_clean_2['url'].str.contains(keyword, case=False, na=False)].copy()

In [92]:
df_new = remove_urls_containing(df_clean_2, 'indeed.com')

In [93]:
df_new.info()

<class 'pandas.DataFrame'>
Index: 1765 entries, 1 to 2231
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   url            1765 non-null   str
 1   title          1765 non-null   str
 2   company        1765 non-null   str
 3   location       1765 non-null   str
 4   scrape_date    1765 non-null   datetime64[us]
 5   scrape_time    1765 non-null   object
 6   duplicate_url  1765 non-null   bool
dtypes: bool(1), datetime64[us](1), object(1), str(4)
memory usage: 98.2+ KB

# 3. 데이터 저장

In [95]:
df_new.to_csv("./jobs_merged_0129_clean_LNW.csv")